## Setup and Dependencies

In [1]:
# Dependencies and Setup
import pandas as pd
import numpy as np
import scipy.stats as st

In [2]:
# Load data file into pandas
price_data = pd.read_csv("../data/all_console_prices.csv", encoding='utf-8')
games_data = pd.read_csv("../data/vgsales.csv", encoding='utf-8')
games_data.head()

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82
3,4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00
4,5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37

# Clean All Data
<hr>

### Copy DataFrame

In [3]:
games_all_df = games_data.copy()
games_all_df.count()

Rank            16598
Name            16598
Platform        16598
Year            16327
Genre           16598
Publisher       16540
NA_Sales        16598
EU_Sales        16598
JP_Sales        16598
Other_Sales     16598
Global_Sales    16598
dtype: int64

### Remove Rank Column & Drop Blank Year

In [4]:
games_all_df = games_all_df[['Name', 'Platform', 'Year', 'Genre', 'Publisher', 'NA_Sales', 'EU_Sales', 'JP_Sales', 'Other_Sales', 'Global_Sales']].sort_values(by=['Platform', 'Name']).reset_index(drop=True)

games_all_df['Year'].replace('', np.nan)
games_all_df = games_all_df.dropna()
games_all_df['Year'] = games_all_df['Year'].astype(int)


games_all_df.count()

Name            16291
Platform        16291
Year            16291
Genre           16291
Publisher       16291
NA_Sales        16291
EU_Sales        16291
JP_Sales        16291
Other_Sales     16291
Global_Sales    16291
dtype: int64

### Convert Sales to Units

In [ ]:
games_all_df['NA_Sales']  = games_all_df['NA_Sales'] .multiply(1000000).astype(int).replace(0, np.NaN)
games_all_df['EU_Sales']  = games_all_df['EU_Sales'] .multiply(1000000).astype(int).replace(0, np.NaN)
games_all_df['JP_Sales']  = games_all_df['JP_Sales'] .multiply(1000000).astype(int).replace(0, np.NaN)
games_all_df['Other_Sales']  = games_all_df['Other_Sales'] .multiply(1000000).astype(int).replace(0, np.NaN)
games_all_df['Global_Sales']  = games_all_df['Global_Sales'] .multiply(1000000).astype(int).replace(0, np.NaN)

games_all_df.head()

In [6]:
games_all_df.count()

Name            16291
Platform        16291
Year            16291
Genre           16291
Publisher       16291
NA_Sales        11861
EU_Sales        10667
JP_Sales         6084
Other_Sales      9955
Global_Sales    16291
dtype: int64

### Make Game Names Upper Case & Remove Puncutation

In [7]:
games_all_df['Name'] = games_all_df['Name'].str.upper() 
games_all_df['Name'] = games_all_df['Name'].str.replace(r'[^\w\s]+', '')

games_all_df.head()

,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,ACTION FORCE,2600,1982,Action,CPG Products,500000.0,30000.0,NaN,10000.0,540000
2,ADVENTURES OF TRON,2600,1981,Action,Mattel Interactive,630000.0,30000.0,NaN,10000.0,670000
3,AIR RAID,2600,1981,Action,Men-A-Vision,720000.0,40000.0,NaN,10000.0,770000
5,AIRLOCK,2600,1981,Action,Data Age,360000.0,20000.0,NaN,NaN,390000
6,ALIEN,2600,1981,Action,20th Century Fox Video Games,740000.0,40000.0,NaN,10000.0,790000

In [8]:
# Export file as csv
games_all_df.to_csv(r'..\data\games_all_df.csv', encoding='utf-8', index=False)

# Games Sales Data
<hr>

### Remove Extra Platforms

In [9]:
games_clean = (games_data[(games_data['Platform'] == '2600') | (games_data['Platform'] == 'NES')
                                     | (games_data['Platform'] == 'GEN') | (games_data['Platform'] == 'SNES')
                                     | (games_data['Platform'] == 'N64') | (games_data['Platform'] == 'SCD')
                                     | (games_data['Platform'] == 'SAT') | (games_data['Platform'] == 'PS')]).reset_index(drop=True)

games_clean.count()

Rank            2191
Name            2191
Platform        2191
Year            2164
Genre           2191
Publisher       2188
NA_Sales        2191
EU_Sales        2191
JP_Sales        2191
Other_Sales     2191
Global_Sales    2191
dtype: int64

### Remove Rank Column & Drop Blank Year

In [10]:
games_clean_df = games_clean[['Name', 'Platform', 'Year', 'Genre', 'Publisher', 'NA_Sales', 'EU_Sales', 'JP_Sales', 'Other_Sales', 'Global_Sales']].sort_values(by=['Platform', 'Name']).reset_index(drop=True)

games_clean_df['Year'].replace('', np.nan)
games_clean_df = games_clean_df.dropna()
games_clean_df['Year'] = games_clean_df['Year'].astype(int)


games_clean_df.count()

Name            2164
Platform        2164
Year            2164
Genre           2164
Publisher       2164
NA_Sales        2164
EU_Sales        2164
JP_Sales        2164
Other_Sales     2164
Global_Sales    2164
dtype: int64

In [11]:
games_clean_df.head()

,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,Action Force,2600,1982,Action,CPG Products,0.50,0.03,0.0,0.01,0.54
2,Adventures of Tron,2600,1981,Action,Mattel Interactive,0.63,0.03,0.0,0.01,0.67
3,Air Raid,2600,1981,Action,Men-A-Vision,0.72,0.04,0.0,0.01,0.77
5,Airlock,2600,1981,Action,Data Age,0.36,0.02,0.0,0.00,0.39
6,Alien,2600,1981,Action,20th Century Fox Video Games,0.74,0.04,0.0,0.01,0.79

### Convert Sales to Units

In [12]:
games_clean_df['NA_Sales']  = games_clean_df['NA_Sales'] .multiply(1000000).astype(int).replace(0, np.NaN)
games_clean_df['EU_Sales']  = games_clean_df['EU_Sales'] .multiply(1000000).astype(int).replace(0, np.NaN)
games_clean_df['JP_Sales']  = games_clean_df['JP_Sales'] .multiply(1000000).astype(int).replace(0, np.NaN)
games_clean_df['Other_Sales']  = games_clean_df['Other_Sales'] .multiply(1000000).astype(int).replace(0, np.NaN)
games_clean_df['Global_Sales']  = games_clean_df['Global_Sales'] .multiply(1000000).astype(int).replace(0, np.NaN)

games_clean_df.head()

,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,Action Force,2600,1982,Action,CPG Products,500000.0,30000.0,NaN,10000.0,540000
2,Adventures of Tron,2600,1981,Action,Mattel Interactive,630000.0,30000.0,NaN,10000.0,670000
3,Air Raid,2600,1981,Action,Men-A-Vision,720000.0,40000.0,NaN,10000.0,770000
5,Airlock,2600,1981,Action,Data Age,360000.0,20000.0,NaN,NaN,390000
6,Alien,2600,1981,Action,20th Century Fox Video Games,740000.0,40000.0,NaN,10000.0,790000

### Make Game Names Upper Case & Remove Puncutation

In [13]:
games_clean_df['Name'] = games_clean_df['Name'].str.upper() 
games_clean_df['Name'] = games_clean_df['Name'].str.replace(r'[^\w\s]+', '')

games_clean_df.head()

,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,ACTION FORCE,2600,1982,Action,CPG Products,500000.0,30000.0,NaN,10000.0,540000
2,ADVENTURES OF TRON,2600,1981,Action,Mattel Interactive,630000.0,30000.0,NaN,10000.0,670000
3,AIR RAID,2600,1981,Action,Men-A-Vision,720000.0,40000.0,NaN,10000.0,770000
5,AIRLOCK,2600,1981,Action,Data Age,360000.0,20000.0,NaN,NaN,390000
6,ALIEN,2600,1981,Action,20th Century Fox Video Games,740000.0,40000.0,NaN,10000.0,790000

In [14]:
# Export file as csv
games_clean_df.to_csv(r'..\data\games_clean_df.csv', encoding='utf-8', index=False)

# Price Data
<hr>

### Display Data Frame

In [15]:
price_data_df = price_data[['Console', 'Game Title', 'Price']].sort_values(by=['Console', 'Game Title']).reset_index(drop=True)


price_data_df.head()

  Console               Game Title   Price
0    2600  3-D Tic-Tac-Toe [Atari]   23.31
1    2600  3-D Tic-Tac-Toe [Sears]   83.88
2    2600  A Game of Concentration   28.36
3    2600        Adventure [Atari]   79.72
4    2600        Adventure [Sears]  111.35

### Make Game Title Upper Case & Remove Punctuation

In [16]:
price_data_df['Game Title'] = price_data_df['Game Title'].str.upper() 
price_data_df['Game Title'] = price_data_df['Game Title'].str.replace(r'[^\w\s]+', '')

price_data_df.count()
# price_data_df.head()

Console       5411
Game Title    5411
Price         5411
dtype: int64

### Remove Outliers

In [17]:
price_data_df.drop(price_data_df[price_data_df['Price'] == 0].index, inplace = True) 
price_data_df.count()
# price_data_df.head(20)

Console       5231
Game Title    5231
Price         5231
dtype: int64

In [18]:
quartiles = price_data_df['Price'].quantile([.25,.5,.75])
lowerq = quartiles[0.25]
upperq = quartiles[0.75]
iqr = upperq-lowerq
lower_bound = lowerq - (1.5*iqr)
upper_bound = upperq + (1.5*iqr)

print(f"Price Outliers")
print(f"-----------------------------")
print(f"Lower quartile: {lowerq}")
print(f"Upper quartile: {upperq}")
print(f"Interquartle range: {iqr}")
print(f"Values below {lower_bound} could be outliers.")
print(f"Values above {upper_bound} could be outliers.")
print()

Price Outliers
-----------------------------
Lower quartile: 16.095
Upper quartile: 65.48
Interquartle range: 49.385000000000005
Values below -57.982500000000016 could be outliers.
Values above 139.5575 could be outliers.

In [19]:
price_data_df.drop(price_data_df[price_data_df['Price'] < lower_bound].index, inplace = True) 
price_data_df.drop(price_data_df[price_data_df['Price'] > upper_bound].index, inplace = True) 

price_data_df.count()
# price_data_df.head(20)

Console       4695
Game Title    4695
Price         4695
dtype: int64

### Find Average Price and Add Column

In [20]:
mean = price_data_df[["Price"]].mean()
median = price_data_df[["Price"]].median()

print(mean)
print(median)

Price    37.153806
dtype: float64
Price    27.5
dtype: float64

In [21]:
price_data_df['Mean'] = np.where(price_data_df[['Price']] > mean, True, False)
price_data_df['Median'] = np.where(price_data_df[['Price']] > median, True, False)

price_data_df.head()

  Console               Game Title   Price   Mean  Median
0    2600       3D TICTACTOE ATARI   23.31  False   False
1    2600       3D TICTACTOE SEARS   83.88   True    True
2    2600  A GAME OF CONCENTRATION   28.36  False    True
3    2600          ADVENTURE ATARI   79.72   True    True
4    2600          ADVENTURE SEARS  111.35   True    True

## Merge Data
<hr>

In [22]:
merged_df = pd.merge(games_clean_df, price_data_df,  how='inner', left_on=['Name','Platform'], right_on = ['Game Title','Console'])

merged_df.head()

,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales,Console,Game Title,Price,Mean,Median
0,ADVENTURES OF TRON,2600,1981,Action,Mattel Interactive,630000.0,30000.0,NaN,10000.0,670000,2600,ADVENTURES OF TRON,16.10,False,False
1,AIRLOCK,2600,1981,Action,Data Age,360000.0,20000.0,NaN,NaN,390000,2600,AIRLOCK,17.00,False,False
2,ALIEN,2600,1981,Action,20th Century Fox Video Games,740000.0,40000.0,NaN,10000.0,790000,2600,ALIEN,61.24,True,True
3,ARMOR AMBUSH,2600,1981,Action,Mattel Interactive,150000.0,10000.0,NaN,NaN,170000,2600,ARMOR AMBUSH,9.92,False,False
4,ASTEROIDS,2600,1980,Shooter,Atari,4000000.0,260000.0,NaN,50000.0,4310000,2600,ASTEROIDS,14.06,False,False

In [23]:
merged_df.count()

Name            1283
Platform        1283
Year            1283
Genre           1283
Publisher       1283
NA_Sales        1194
EU_Sales        1181
JP_Sales         370
Other_Sales      876
Global_Sales    1283
Console         1283
Game Title      1283
Price           1283
Mean            1283
Median          1283
dtype: int64

In [24]:
# Export file as csv
merged_df.to_csv(r'..\data\merged_games_df.csv', encoding='utf-8', index=False)